# 1. Considere as tabelas de vendas diárias de três lojas:

In [4]:
import pandas as pd
import numpy as np

Mercearia = pd.DataFrame({"loja":["A", "A", "A"],
"dia": ["sex", "sab", "dom"],
"valor": [7500, 9500, 8200]})

Mercearia

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200

In [5]:
Farmacia = pd.DataFrame({"loja":["B", "B", "B"],
"dia": ["sex", "sab", "dom"],
"valor": [5100, 8250, 9900]})

Farmacia

  loja  dia  valor
0    B  sex   5100
1    B  sab   8250
2    B  dom   9900

In [6]:
Restaurante = pd.DataFrame({"loja":["C", "C"],
"dia": ["sab", "dom"],
"valor": [7500, 11800]})

Restaurante

  loja  dia  valor
0    C  sab   7500
1    C  dom  11800

In [28]:
novoDF1 = pd.concat([Mercearia, Farmacia, Restaurante], ignore_index = True)
novoDF1

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
3    B  sex   5100
4    B  sab   8250
5    B  dom   9900
6    C  sab   7500
7    C  dom  11800

In [27]:
novoDF2 = pd.concat([Mercearia, Farmacia, Restaurante], axis = 1, ignore_index = True)
novoDF2

   0    1     2  3    4     5    6    7        8
0  A  sex  7500  B  sex  5100    C  sab   7500.0
1  A  sab  9500  B  sab  8250    C  dom  11800.0
2  A  dom  8200  B  dom  9900  NaN  NaN      NaN

A concatenção coluna por coluna, junta dois dataframes através de suas colunas. Já a concatenação linha por linha, junta dois dataframe através das linhas. O NaN aparece quando o número de colunas e/ou linhas são diferentes entre os dataframes.

# 2. Com base nos dataframes a seguir, que guardam informações de matriculas de alunos em dois cursos, um de SQL e outro de Python:

In [25]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
"ecg@acmecorpus.com"]})

PYTHON = pd.DataFrame({"email":["ana@xyz.com",
"jonas@acmecorpus.com",
"rakesh@xyz.com"]})

(a) quais são os alunos distintos, considerando ambas as listas?

In [29]:
alunosDistintos = pd.concat([SQL, PYTHON], axis=0,ignore_index = True)
alunosDistintos.drop_duplicates()

                  email
0        rakesh@xyz.com
1    ecg@acmecorpus.com
2           ana@xyz.com
3  jonas@acmecorpus.com

(b) quais são os alunos que fizeram ambos os cursos?

In [30]:
pd.merge(SQL, PYTHON, on = 'email')

            email
0  rakesh@xyz.com

(c) quais os alunos que realizaram o curso de SQL, mas não o de PYTHON (e vice-versa)?

In [31]:
apenas_sql = SQL[SQL.email.isin(PYTHON.email)==False]
apenas_sql

                email
1  ecg@acmecorpus.com

In [32]:
apenas_python = PYTHON[PYTHON.email.isin(SQL.email)==False]
apenas_python

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com

# 3. Considere os dois dataframes a seguir, referentes aos dados sobre os departamentose os funcionários de uma empresa.

In [34]:
dic_emp = {"id":["D1","D2","D3","D4"],
"nomDepto": ["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]
}

empresa = pd.DataFrame(dic_emp)
empresa

   id nomDepto local
0  D1  Compras    SP
1  D2       RH    RJ
2  D3       TI    RJ
3  D4   Vendas    SP

In [35]:
dic_func = {"num":[3199,3269,3555,3788,3844],
"nome": ["Ana","David","José","Marina","Luís"],
"salario":[1600,2975,1500,5000,3000],
"idDepto": ["D2","D3",None,"D2","D4"]
}

funcionarios = pd.DataFrame(dic_func)
funcionarios

    num    nome  salario idDepto
0  3199     Ana     1600      D2
1  3269   David     2975      D3
2  3555    José     1500    None
3  3788  Marina     5000      D2
4  3844    Luís     3000      D4

Combine os dados dos funcionários com os dados dos departamentos para criar um
novo dataframe completo sobre a empresa, usando merge.

In [39]:
novoDF = pd.merge(funcionarios, empresa, left_on="idDepto", right_on="id")
print(novoDF)

    num    nome  salario idDepto  id nomDepto local
0  3199     Ana     1600      D2  D2       RH    RJ
1  3788  Marina     5000      D2  D2       RH    RJ
2  3269   David     2975      D3  D3       TI    RJ
3  3844    Luís     3000      D4  D4   Vendas    SP